In [2]:
import pandas as pd

In [3]:

#dataframe dengan list
#data yang tersedia sebagai berikut:
list_belanjaan = ['tempe', 'tahu', 'beras', 'kecap',"tomat","mayonaise"]
list_jenis = ['alami','alami','alami','pabrikan','alami','pabrikan']
list_kuantitas = [10,10,3,1,4,1]
list_harga_satuan = [3000,2500,10000,15000,6000,12000]
list_units = ['per-pack','per-pack', 'per-Kg','per-botol', 'per-Kg','per-botol']

In [137]:
#pembuatan dataframe baru dengan nama df_belanjaan
df_belanjaan = pd.DataFrame()

#data di atas, masih kosong/kopong

In [138]:
#Metode 1: penambahan kolom baru pada dataframe dengan list
df_belanjaan['belanjaan'] = list_belanjaan
df_belanjaan['jenis'] = list_jenis
df_belanjaan['jumlah'] = list_kuantitas
df_belanjaan['satuan'] = list_units
df_belanjaan['harga_satuan'] = list_harga_satuan

#tampilkan
df_belanjaan

   belanjaan     jenis  jumlah     satuan  harga_satuan
0      tempe     alami      10   per-pack          3000
1       tahu     alami      10   per-pack          2500
2      beras     alami       3     per-Kg         10000
3      kecap  pabrikan       1  per-botol         15000
4      tomat     alami       4     per-Kg          6000
5  mayonaise  pabrikan       1  per-botol         12000

In [4]:
#Metode 2
df_belanjaan=pd.DataFrame(list(zip(list_belanjaan, list_jenis,list_kuantitas,list_units,list_harga_satuan)),
                          columns =['belanjaan', 'jenis','jumlah','satuan','harga_satuan'])

#tampilkan
df_belanjaan

   belanjaan     jenis  jumlah     satuan  harga_satuan
0      tempe     alami      10   per-pack          3000
1       tahu     alami      10   per-pack          2500
2      beras     alami       3     per-Kg         10000
3      kecap  pabrikan       1  per-botol         15000
4      tomat     alami       4     per-Kg          6000
5  mayonaise  pabrikan       1  per-botol         12000

In [1]:
#pembuatan dataframe dengan dictionary
#ada beberapa cara pembuatan dataframe dengan dict,
#berikut salah satu contoh template nya.
import pandas as pd

df_belanjaan_dictionary = pd.DataFrame({                                                # pd.DataFrame({
    'belanjaan': ['tempe', 'tahu', 'beras', 'kecap',"tomat","mayonaise"],               # "column_title" : [column_cell_value]
    'jenis': ['alami','alami','alami','pabrikan','alami','pabrikan'],                   # "column_title" : [column_cell_value]
    'jumlah': [10,10,3,1,4,1],                                                          # "column_title" : [column_cell_value]
    'satuan': ['per-pack','per-pack', 'per-Kg','per-botol', 'per-Kg','per-botol'],      # "column_title" : [column_cell_value]
    'harga_satuan': [3000,2500,10000,15000,6000,12000]                                  # "column_title" : [column_cell_value]
})                                                                                      # })

In [2]:
df_belanjaan_dictionary.to_dict('list')

{'belanjaan': ['tempe', 'tahu', 'beras', 'kecap', 'tomat', 'mayonaise'],
 'jenis': ['alami', 'alami', 'alami', 'pabrikan', 'alami', 'pabrikan'],
 'jumlah': [10, 10, 3, 1, 4, 1],
 'satuan': ['per-pack',
  'per-pack',
  'per-Kg',
  'per-botol',
  'per-Kg',
  'per-botol'],
 'harga_satuan': [3000, 2500, 10000, 15000, 6000, 12000]}

In [140]:
#operasi matematika dasar
#berlaku juga dengan operasi matematika dasar yg lain ( + , - , /)
df_belanjaan['jumlah x harga_satuan'] = df_belanjaan ['jumlah'] * df_belanjaan['harga_satuan']

#tampilkan
df_belanjaan

   belanjaan     jenis  jumlah     satuan  harga_satuan  jumlah x harga_satuan
0      tempe     alami      10   per-pack          3000                  30000
1       tahu     alami      10   per-pack          2500                  25000
2      beras     alami       3     per-Kg         10000                  30000
3      kecap  pabrikan       1  per-botol         15000                  15000
4      tomat     alami       4     per-Kg          6000                  24000
5  mayonaise  pabrikan       1  per-botol         12000                  12000

In [141]:
#menghitung harga total
harga_total = sum(df_belanjaan['jumlah x harga_satuan'])
barang_utama = len(df_belanjaan['belanjaan'])

print(f"jadi total jenis item yang dibeli adalah {barang_utama} item belanjaan, dengan harga total sebesar Rp. {harga_total}")

jadi total jenis item yang dibeli adalah 6 item belanjaan, dengan harga total sebesar Rp. 136000

In [142]:
#sortir dataframe dengan query
#mensortir barang dengan jumlah lebih dari 5
df_belanjaan.query("jumlah > 5")

  belanjaan  jenis  jumlah    satuan  harga_satuan  jumlah x harga_satuan
0     tempe  alami      10  per-pack          3000                  30000
1      tahu  alami      10  per-pack          2500                  25000

In [143]:
#mensortir barang dengan suatu nilai tertentu
df_belanjaan.query("belanjaan == 'beras' ")

  belanjaan  jenis  jumlah  satuan  harga_satuan  jumlah x harga_satuan
2     beras  alami       3  per-Kg         10000                  30000

In [144]:
#mensortir barang dengan suatu nilai tertentu
df_belanjaan.query(f"jumlah == {10} ")

  belanjaan  jenis  jumlah    satuan  harga_satuan  jumlah x harga_satuan
0     tempe  alami      10  per-pack          3000                  30000
1      tahu  alami      10  per-pack          2500                  25000

In [145]:
#mensortir barang dengan multi kriteria
df_belanjaan.query(f"harga_satuan > {2700} and jumlah > {2} ")

  belanjaan  jenis  jumlah    satuan  harga_satuan  jumlah x harga_satuan
0     tempe  alami      10  per-pack          3000                  30000
2     beras  alami       3    per-Kg         10000                  30000
4     tomat  alami       4    per-Kg          6000                  24000

In [12]:
#melakukan analisis based on group "sum"
df_belanjaan.groupby(by="jenis").sum()

          jumlah  harga_satuan  jumlah x harga_satuan
jenis
alami         27         21500                 109000
pabrikan       2         27000                  27000

In [13]:
#melakukan ranking 3 teratas based on jumlah
df_belanjaan.nlargest(3, "jumlah")

  belanjaan  jenis  jumlah    satuan  harga_satuan  jumlah x harga_satuan
0     tempe  alami      10  per-pack          3000                  30000
1      tahu  alami      10  per-pack          2500                  25000
4     tomat  alami       4    per-Kg          6000                  24000

In [14]:
#melakukan ranking 3 barang termurah
df_belanjaan.nsmallest(3, "harga_satuan")

  belanjaan  jenis  jumlah    satuan  harga_satuan  jumlah x harga_satuan
1      tahu  alami      10  per-pack          2500                  25000
0     tempe  alami      10  per-pack          3000                  30000
4     tomat  alami       4    per-Kg          6000                  24000

In [15]:
df_belanjaan

   belanjaan     jenis  jumlah     satuan  harga_satuan  jumlah x harga_satuan
0      tempe     alami      10   per-pack          3000                  30000
1       tahu     alami      10   per-pack          2500                  25000
2      beras     alami       3     per-Kg         10000                  30000
3      kecap  pabrikan       1  per-botol         15000                  15000
4      tomat     alami       4     per-Kg          6000                  24000
5  mayonaise  pabrikan       1  per-botol         12000                  12000

In [16]:
#fungsi df.iloc dan df.loc untuk data slicing (pemotongan)
#untuk mengetahui nilai cell pada koordinat yang dituju
#code dibawah menghasilkan nilai yang sama yaitu 15000
#perbedaan 1: iloc menggunakan index angka, sedangkan loc menggunakan 'nama' dari index row dan kolom

df_belanjaan.iloc[3,4]

15000

In [17]:
#slicing menggunakan loc. Function loc menggunakan 'nama' dari index row dan kolom
df_belanjaan.loc[3,'harga_satuan']

15000

In [18]:
#iloc dan loc dengan satu angka akan memberikan nilai row
#code dibawah untuk mengetahui row nomor 3

df_belanjaan.iloc[3]

belanjaan                    kecap
jenis                     pabrikan
jumlah                           1
satuan                   per-botol
harga_satuan                 15000
jumlah x harga_satuan        15000
Name: 3, dtype: object

In [19]:
df_belanjaan.loc[3]

belanjaan                    kecap
jenis                     pabrikan
jumlah                           1
satuan                   per-botol
harga_satuan                 15000
jumlah x harga_satuan        15000
Name: 3, dtype: object

In [20]:
#dataframe_anda.iloc [row_awal:row_akhir   ,  kolom_awal:kolom_akhir ]
#dalam bentuk index angka row dan kolom

#code dibawah untuk menampilkan semua data, jika awal dan akhir row/kolom dikosongi
df_belanjaan.iloc[ : , :]

   belanjaan     jenis  jumlah     satuan  harga_satuan  jumlah x harga_satuan
0      tempe     alami      10   per-pack          3000                  30000
1       tahu     alami      10   per-pack          2500                  25000
2      beras     alami       3     per-Kg         10000                  30000
3      kecap  pabrikan       1  per-botol         15000                  15000
4      tomat     alami       4     per-Kg          6000                  24000
5  mayonaise  pabrikan       1  per-botol         12000                  12000

In [21]:
#dataframe_anda.loc [row_awal:row_akhir   ,  kolom_awal:kolom_akhir ]
#dalam bentuk "nama" dari index row dan kolom

#code dibawah untuk menampilkan semua data, jika awal dan akhir row/kolom dikosongi
df_belanjaan.loc[ : , :]

   belanjaan     jenis  jumlah     satuan  harga_satuan  jumlah x harga_satuan
0      tempe     alami      10   per-pack          3000                  30000
1       tahu     alami      10   per-pack          2500                  25000
2      beras     alami       3     per-Kg         10000                  30000
3      kecap  pabrikan       1  per-botol         15000                  15000
4      tomat     alami       4     per-Kg          6000                  24000
5  mayonaise  pabrikan       1  per-botol         12000                  12000

In [22]:
#perbedaan 2:
#jika setelah koma dikosongi maka  dataframe_anda.iloc [row_awal:row_akhir]
#dengan iloc: code dibawah untuk memotong/mengambil data pada row 0 - 2
df_belanjaan.iloc[0:3]

  belanjaan  jenis  jumlah    satuan  harga_satuan  jumlah x harga_satuan
0     tempe  alami      10  per-pack          3000                  30000
1      tahu  alami      10  per-pack          2500                  25000
2     beras  alami       3    per-Kg         10000                  30000

In [23]:
#dengan loc: code dibawah untuk mensortir data pada row 0 - 3
#jika setelah koma dikosongi maka  dataframe_anda.iloc [row_awal:row_akhir]
df_belanjaan.loc[0:3]

  belanjaan     jenis  jumlah     satuan  harga_satuan  jumlah x harga_satuan
0     tempe     alami      10   per-pack          3000                  30000
1      tahu     alami      10   per-pack          2500                  25000
2     beras     alami       3     per-Kg         10000                  30000
3     kecap  pabrikan       1  per-botol         15000                  15000

In [24]:
#setelah koma, baik iloc maupun loc adalah koordinat posisi kolom yang diinginkan
#dengan code dibawah, akan di slice pada row index 0 - 2, dan kolom jenis
df_belanjaan.iloc[0:3 , 1]

0    alami
1    alami
2    alami
Name: jenis, dtype: object

In [25]:
#setelah koma baik iloc maupun loc adalah posisi kolom yang diinginkan
#dengan code dibawah, akan di slice pada row index 0 - 3, dan kolom jenis
df_belanjaan.loc[0:3 , 'jenis']

0       alami
1       alami
2       alami
3    pabrikan
Name: jenis, dtype: object

In [26]:
#setelah koma baik iloc maupun loc adalah posisi kolom yang diinginkan
#dengan code dibawah, akan di slice pada row index 0 - 2, dan kolom belanjaan dan harga satuan
df_belanjaan.iloc[0:3 , [0,4]]

  belanjaan  harga_satuan
0     tempe          3000
1      tahu          2500
2     beras         10000

In [27]:
#dengan code dibawah, akan di slice pada row index 0 - 3, dan kolom belanjaan dan harga satuan
df_belanjaan.loc[0:3 , ['belanjaan','harga_satuan']]

  belanjaan  harga_satuan
0     tempe          3000
1      tahu          2500
2     beras         10000
3     kecap         15000

In [28]:
#merubah index kolom menjadi suatu kolom
#merubah index kolom ke nama belanjaan
#code dibawah menggunakan nama variable baru untuk melakukan saving perubahan data,
#dalam hal ini adalah perubahan index. tidak merubah dataframe lama

df_belanjaan_indexbaru = df_belanjaan.set_index('belanjaan')
df_belanjaan_indexbaru

              jenis  jumlah     satuan  harga_satuan  jumlah x harga_satuan
belanjaan
tempe         alami      10   per-pack          3000                  30000
tahu          alami      10   per-pack          2500                  25000
beras         alami       3     per-Kg         10000                  30000
kecap      pabrikan       1  per-botol         15000                  15000
tomat         alami       4     per-Kg          6000                  24000
mayonaise  pabrikan       1  per-botol         12000                  12000

In [29]:
#jika ingin menggunakan variable nama yang lama, atau
#ingin mereplace data yang lama dengan index baru, maka gunakan inplace

df_belanjaan.set_index('belanjaan', inplace=True)
df_belanjaan

              jenis  jumlah     satuan  harga_satuan  jumlah x harga_satuan
belanjaan
tempe         alami      10   per-pack          3000                  30000
tahu          alami      10   per-pack          2500                  25000
beras         alami       3     per-Kg         10000                  30000
kecap      pabrikan       1  per-botol         15000                  15000
tomat         alami       4     per-Kg          6000                  24000
mayonaise  pabrikan       1  per-botol         12000                  12000

In [30]:
#karena index kolom sudah berubah menjadi nama belanjaan,
#maka posisi kolom untuk df.iloc yang menggunakan angka juga berubah
#dan posisi kolom untuk df.loc juga harus menggunakan nama index baru

df_belanjaan.iloc[0:3 , 1]

belanjaan
tempe    10
tahu     10
beras     3
Name: jumlah, dtype: int64

In [31]:
#sebelum di inplace pada row menggunakan angka, karena nama index masih angka
#sekarang, df.loc harus menggunakan nama baru.

df_belanjaan.loc['tempe':'beras' , 'jumlah']

belanjaan
tempe    10
tahu     10
beras     3
Name: jumlah, dtype: int64

In [32]:
#mengurutkan data berdasarkan nilai suatu kolom
df_belanjaan.sort_values(['jumlah'], ascending=[True])

              jenis  jumlah     satuan  harga_satuan  jumlah x harga_satuan
belanjaan
kecap      pabrikan       1  per-botol         15000                  15000
mayonaise  pabrikan       1  per-botol         12000                  12000
beras         alami       3     per-Kg         10000                  30000
tomat         alami       4     per-Kg          6000                  24000
tempe         alami      10   per-pack          3000                  30000
tahu          alami      10   per-pack          2500                  25000

In [33]:
#mengurutkan data berdasarkan nilai multi kolom
#sort_values urutan pertama akan dimenangkan
df_belanjaan.sort_values(['jumlah','harga_satuan'], ascending=[True,True])

              jenis  jumlah     satuan  harga_satuan  jumlah x harga_satuan
belanjaan
mayonaise  pabrikan       1  per-botol         12000                  12000
kecap      pabrikan       1  per-botol         15000                  15000
beras         alami       3     per-Kg         10000                  30000
tomat         alami       4     per-Kg          6000                  24000
tahu          alami      10   per-pack          2500                  25000
tempe         alami      10   per-pack          3000                  30000

In [34]:
#untuk merubah dataframe secara permanen gunakan inplace setelah sortir
#atau assign kepada variable baru

df_belanjaan.sort_values(['harga_satuan'], ascending=[True], inplace=True)
df_belanjaan

              jenis  jumlah     satuan  harga_satuan  jumlah x harga_satuan
belanjaan
tahu          alami      10   per-pack          2500                  25000
tempe         alami      10   per-pack          3000                  30000
tomat         alami       4     per-Kg          6000                  24000
beras         alami       3     per-Kg         10000                  30000
mayonaise  pabrikan       1  per-botol         12000                  12000
kecap      pabrikan       1  per-botol         15000                  15000

In [35]:
#untuk mereset index gunakan fitur reset index
df_belanjaan.reset_index(inplace=True)
df_belanjaan

   belanjaan     jenis  jumlah     satuan  harga_satuan  jumlah x harga_satuan
0       tahu     alami      10   per-pack          2500                  25000
1      tempe     alami      10   per-pack          3000                  30000
2      tomat     alami       4     per-Kg          6000                  24000
3      beras     alami       3     per-Kg         10000                  30000
4  mayonaise  pabrikan       1  per-botol         12000                  12000
5      kecap  pabrikan       1  per-botol         15000                  15000

In [36]:
#membuang suatu kolom tertentu
df_belanjaan.drop(['index'], axis=1, inplace=True)

KeyError: "['index'] not found in axis"

In [37]:
df_belanjaan

   belanjaan     jenis  jumlah     satuan  harga_satuan  jumlah x harga_satuan
0       tahu     alami      10   per-pack          2500                  25000
1      tempe     alami      10   per-pack          3000                  30000
2      tomat     alami       4     per-Kg          6000                  24000
3      beras     alami       3     per-Kg         10000                  30000
4  mayonaise  pabrikan       1  per-botol         12000                  12000
5      kecap  pabrikan       1  per-botol         15000                  15000

In [44]:
#data modifikasi menggunakan iloc dan loc
#contoh1: mengganti harga tomat menjadi 7000 dengan iloc

#index kolom harga_satuan = No.4
#index row tomat  = No.2

df_belanjaan.iloc[2,4] = 7000
df_belanjaan

# kolom jumlah x harga satuan belum di update menjadi 28000, karena belum di eksekusi ulang

   belanjaan     jenis  jumlah     satuan  harga_satuan  jumlah x harga_satuan
0       tahu     alami      10   per-pack          2500                  25000
1      tempe     alami      10   per-pack          3000                  30000
2      tomat     alami       4     per-Kg          7000                  24000
3      beras     alami       3     per-Kg         10000                  30000
4  mayonaise  pabrikan       1  per-botol         12000                  12000
5      kecap  pabrikan       1  per-botol         15000                  15000

In [45]:
#contoh2: mengganti jumlah x harga_satuan tomat menjadi 28000 dengan loc

#nama kolom harga_satuan = 'jumlah x harga_satuan'
#nama row tomat adalah  = No. 2

df_belanjaan.loc[2,'jumlah x harga_satuan'] = 28000
df_belanjaan

   belanjaan     jenis  jumlah     satuan  harga_satuan  jumlah x harga_satuan
0       tahu     alami      10   per-pack          2500                  25000
1      tempe     alami      10   per-pack          3000                  30000
2      tomat     alami       4     per-Kg          7000                  28000
3      beras     alami       3     per-Kg         10000                  30000
4  mayonaise  pabrikan       1  per-botol         12000                  12000
5      kecap  pabrikan       1  per-botol         15000                  15000

In [46]:
#cumsum: fitur pandas untuk menghitung kumulatif suatu kolom
#dari atas kolom ke bawah
df_belanjaan['harga_kumulatif'] = df_belanjaan['jumlah x harga_satuan'].cumsum()
df_belanjaan

,belanjaan,jenis,jumlah,satuan,harga_satuan,jumlah x harga_satuan,harga_kumulatif
0,tahu,alami,10,per-pack,2500,25000,25000
1,tempe,alami,10,per-pack,3000,30000,55000
2,tomat,alami,4,per-Kg,7000,28000,83000
3,beras,alami,3,per-Kg,10000,30000,113000
4,mayonaise,pabrikan,1,per-botol,12000,12000,125000
5,kecap,pabrikan,1,per-botol,15000,15000,140000

pandas soil profile

In [2]:
import pandas as pd
import numpy as np

#import CSV file 1
df_soil_profile = pd.read_csv('ground.csv')
df_spt = pd.read_csv('spt.csv')

jumlah_layer = len(df_soil_profile['soil_type'])

In [5]:
df_spt

   depth  SPT
0    1.0    8
1    1.5    9
2    3.0    8
3    4.5   12
4    6.0   15
5    7.5   15
6    9.0   16

In [7]:
#membuat threshold kedalaman yang nanti akan digunakan pada data frame utama
interval = 0.01
bottom = 12
list_depth = np.arange(0,bottom,interval)

In [8]:
#soil profile top layer
# akan digunakan/digabung dengan data yang lain
soil_top = df_soil_profile.drop('depth_bot', axis=1)
soil_top['depth_bot']=soil_top['depth_top']+interval
second_column = soil_top.pop('depth_bot')
soil_top.insert(1, 'depth_bot', second_column)
soil_top

   depth_top  depth_bot                soil_type  gsat  gunsat
0        0.0       0.01      sand - medium dense    17      18
1        3.0       3.01       silty clay - stiff    15      15
2        5.5       5.51  silty clay - very stiff    16      16

In [9]:
#membuat dataframe utama untuk perhitungan
df_calculation = pd.DataFrame()
df_calculation['depth_top']=list_depth

df_calculation = df_calculation.round({'depth_top': 2, 'depth_bot': 2})
df_calculation

      depth_top
0          0.00
1          0.01
2          0.02
3          0.03
4          0.04
...         ...
1195      11.95
1196      11.96
1197      11.97
1198      11.98
1199      11.99

[1200 rows x 1 columns]

In [10]:
#menggabungkan dataframe utama dengan data soil profile dan SPT
#kotak ini run sekali saja, kalau di run berkali2 akan muncul kolom baru bekas index

#dari data csv SPT, nama depth akan dirubah menjadi depth_top
#hal  ini berguna saat melakukan join data.
df_spt.rename(columns = {'depth':'depth_top'}, inplace = True)

df_all = df_calculation.set_index('depth_top').join(soil_top.set_index('depth_top')).join(df_spt.set_index('depth_top'))
df_all.reset_index(inplace=True)

#melakukan update kedalaman bawah
df_all['depth_bot']=df_all['depth_top']+interval
df_all

      depth_top  depth_bot            soil_type  gsat  gunsat  SPT
0          0.00       0.01  sand - medium dense  17.0    18.0  NaN
1          0.01       0.02                  NaN   NaN     NaN  NaN
2          0.02       0.03                  NaN   NaN     NaN  NaN
3          0.03       0.04                  NaN   NaN     NaN  NaN
4          0.04       0.05                  NaN   NaN     NaN  NaN
...         ...        ...                  ...   ...     ...  ...
1195      11.95      11.96                  NaN   NaN     NaN  NaN
1196      11.96      11.97                  NaN   NaN     NaN  NaN
1197      11.97      11.98                  NaN   NaN     NaN  NaN
1198      11.98      11.99                  NaN   NaN     NaN  NaN
1199      11.99      12.00                  NaN   NaN     NaN  NaN

[1200 rows x 6 columns]

In [11]:
#dengan ffill maka semua NaN akan terisi otomatis dari value diatasnya.
#untuk nilai NSPT permukaan akan tidak berubah, karena NSPT tidak dimulai dari kedalaman 0
df_all.fillna(method='ffill',inplace=True)
df_all

      depth_top  depth_bot                soil_type  gsat  gunsat   SPT
0          0.00       0.01      sand - medium dense  17.0    18.0   NaN
1          0.01       0.02      sand - medium dense  17.0    18.0   NaN
2          0.02       0.03      sand - medium dense  17.0    18.0   NaN
3          0.03       0.04      sand - medium dense  17.0    18.0   NaN
4          0.04       0.05      sand - medium dense  17.0    18.0   NaN
...         ...        ...                      ...   ...     ...   ...
1195      11.95      11.96  silty clay - very stiff  16.0    16.0  16.0
1196      11.96      11.97  silty clay - very stiff  16.0    16.0  16.0
1197      11.97      11.98  silty clay - very stiff  16.0    16.0  16.0
1198      11.98      11.99  silty clay - very stiff  16.0    16.0  16.0
1199      11.99      12.00  silty clay - very stiff  16.0    16.0  16.0

[1200 rows x 6 columns]

In [12]:
#untuk itu SPT pada permukaan harus dimodifikasi
# berAsumsi bahwa nilai SPT permukaan sama dengan nilai SPT pertama yang muncul (depth 1.0 m)
df_all.loc[0,'SPT']=df_spt.loc[0,'SPT']

df_all.fillna(method='ffill',inplace=True)
df_all

      depth_top  depth_bot                soil_type  gsat  gunsat   SPT
0          0.00       0.01      sand - medium dense  17.0    18.0   8.0
1          0.01       0.02      sand - medium dense  17.0    18.0   8.0
2          0.02       0.03      sand - medium dense  17.0    18.0   8.0
3          0.03       0.04      sand - medium dense  17.0    18.0   8.0
4          0.04       0.05      sand - medium dense  17.0    18.0   8.0
...         ...        ...                      ...   ...     ...   ...
1195      11.95      11.96  silty clay - very stiff  16.0    16.0  16.0
1196      11.96      11.97  silty clay - very stiff  16.0    16.0  16.0
1197      11.97      11.98  silty clay - very stiff  16.0    16.0  16.0
1198      11.98      11.99  silty clay - very stiff  16.0    16.0  16.0
1199      11.99      12.00  silty clay - very stiff  16.0    16.0  16.0

[1200 rows x 6 columns]

In [13]:
#contoh 1: function lambda apply
#buat dataframe status yg berguna untuk memberi keterangan bahwa posisi ini diatas air atau dibawah air
#jika kedalaman air di 1 m dibawah muka tanah maka

#buat kolom tanpa value
df_all['status']=np.NaN

water_depth = 1

df_all['status'] = df_all['depth_bot'].apply(lambda x: 'above_water' if x <= water_depth else "below_water")
df_all

,depth_top,depth_bot,soil_type,gsat,gunsat,SPT,status
0,0.00,0.01,sand - medium dense,17.0,18.0,8.0,above_water
1,0.01,0.02,sand - medium dense,17.0,18.0,8.0,above_water
2,0.02,0.03,sand - medium dense,17.0,18.0,8.0,above_water
3,0.03,0.04,sand - medium dense,17.0,18.0,8.0,above_water
4,0.04,0.05,sand - medium dense,17.0,18.0,8.0,above_water
...,...,...,...,...,...,...,...
1195,11.95,11.96,silty clay - very stiff,16.0,16.0,16.0,below_water
1196,11.96,11.97,silty clay - very stiff,16.0,16.0,16.0,below_water
1197,11.97,11.98,silty clay - very stiff,16.0,16.0,16.0,below_water
1198,11.98,11.99,silty clay - very stiff,16.0,16.0,16.0,below_water
1199,11.99,12.00,silty clay - very stiff,16.0,16.0,16.0,below_water

In [14]:
#contoh 2: function assign
# menghitung effective stress yang terjadi
df_all['total_bot'] = np.nan

def stress_calculation(x):
    global interval
    if x['status'] == 'above_water':
        return x['gunsat']*interval
    elif x['status'] == 'below_water':
        return x['gsat']*interval

df_all = df_all.assign(total_bot=df_all.apply(stress_calculation, axis=1))

In [15]:
#menghitung kumulatif total stress yang terjadi
df_all['total_bot']= df_all['total_bot'].cumsum()
df_all

,depth_top,depth_bot,soil_type,gsat,gunsat,SPT,status,total_bot,total_bot
0,0.00,0.01,sand - medium dense,17.0,18.0,8.0,above_water,0.18,0.18
1,0.01,0.02,sand - medium dense,17.0,18.0,8.0,above_water,0.18,0.36
2,0.02,0.03,sand - medium dense,17.0,18.0,8.0,above_water,0.18,0.54
3,0.03,0.04,sand - medium dense,17.0,18.0,8.0,above_water,0.18,0.72
4,0.04,0.05,sand - medium dense,17.0,18.0,8.0,above_water,0.18,0.90
...,...,...,...,...,...,...,...,...,...
1195,11.95,11.96,silty clay - very stiff,16.0,16.0,16.0,below_water,0.16,192.86
1196,11.96,11.97,silty clay - very stiff,16.0,16.0,16.0,below_water,0.16,193.02
1197,11.97,11.98,silty clay - very stiff,16.0,16.0,16.0,below_water,0.16,193.18
1198,11.98,11.99,silty clay - very stiff,16.0,16.0,16.0,below_water,0.16,193.34
1199,11.99,12.00,silty clay - very stiff,16.0,16.0,16.0,below_water,0.16,193.50

In [17]:
#menghitung tekanan air
df_all['w_bot']= np.nan

def hidrostatic_press(x):
    global water_depth
    gwater = 10
    if x['status'] == 'above_water':
        return 0
    elif x['status'] == 'below_water':
        return (x['depth_bot'] - water_depth)*gwater

df_all = df_all.assign(w_bot=df_all.apply(hidrostatic_press, axis=1))
df_all

,depth_top,depth_bot,soil_type,gsat,gunsat,SPT,status,total_bot,total_bot,w_bot
0,0.00,0.01,sand - medium dense,17.0,18.0,8.0,above_water,0.18,0.18,0.0
1,0.01,0.02,sand - medium dense,17.0,18.0,8.0,above_water,0.18,0.36,0.0
2,0.02,0.03,sand - medium dense,17.0,18.0,8.0,above_water,0.18,0.54,0.0
3,0.03,0.04,sand - medium dense,17.0,18.0,8.0,above_water,0.18,0.72,0.0
4,0.04,0.05,sand - medium dense,17.0,18.0,8.0,above_water,0.18,0.90,0.0
...,...,...,...,...,...,...,...,...,...,...
1195,11.95,11.96,silty clay - very stiff,16.0,16.0,16.0,below_water,0.16,192.86,109.6
1196,11.96,11.97,silty clay - very stiff,16.0,16.0,16.0,below_water,0.16,193.02,109.7
1197,11.97,11.98,silty clay - very stiff,16.0,16.0,16.0,below_water,0.16,193.18,109.8
1198,11.98,11.99,silty clay - very stiff,16.0,16.0,16.0,below_water,0.16,193.34,109.9
1199,11.99,12.00,silty clay - very stiff,16.0,16.0,16.0,below_water,0.16,193.50,110.0

In [17]:
#menghitung vertical eff stress
df_all["'v_bot"]=df_all['total_bot'] - df_all['w_bot']
df_all

,depth_top,depth_bot,soil_type,gsat,gunsat,SPT,status,total_bot,total_bot,w_bot,'v_bot
0,0.00,0.01,sand - medium dense,17.0,18.0,8.0,above_water,0.18,0.18,0.0,0.18
1,0.01,0.02,sand - medium dense,17.0,18.0,8.0,above_water,0.18,0.36,0.0,0.36
2,0.02,0.03,sand - medium dense,17.0,18.0,8.0,above_water,0.18,0.54,0.0,0.54
3,0.03,0.04,sand - medium dense,17.0,18.0,8.0,above_water,0.18,0.72,0.0,0.72
4,0.04,0.05,sand - medium dense,17.0,18.0,8.0,above_water,0.18,0.90,0.0,0.90
...,...,...,...,...,...,...,...,...,...,...,...
1195,11.95,11.96,silty clay - very stiff,16.0,16.0,16.0,below_water,0.16,192.86,109.6,83.26
1196,11.96,11.97,silty clay - very stiff,16.0,16.0,16.0,below_water,0.16,193.02,109.7,83.32
1197,11.97,11.98,silty clay - very stiff,16.0,16.0,16.0,below_water,0.16,193.18,109.8,83.38
1198,11.98,11.99,silty clay - very stiff,16.0,16.0,16.0,below_water,0.16,193.34,109.9,83.44
1199,11.99,12.00,silty clay - very stiff,16.0,16.0,16.0,below_water,0.16,193.50,110.0,83.50

In [1]:
import pandas as pd

#Komposisi beton berdasarkan kualitasnya menurut SNI DT-91-2007
beton_1 = {'K100': {'semen': 247, 'pasir': 869, 'kerikil': 999,'air':215,'w/c':0.87}}
beton_2 = {'K125': {'semen': 276, 'pasir': 828, 'kerikil': 1012,'air':215,'w/c':0.78}}
beton_3 = {'K150': {'semen': 299, 'pasir': 799, 'kerikil': 1017,'air':215,'w/c':0.72}}
beton_4 = {'K175': {'semen': 326, 'pasir': 760, 'kerikil': 1029,'air':215,'w/c':0.66}}
beton_5 = {'K200': {'semen': 352, 'pasir': 731, 'kerikil': 1031,'air':215,'w/c':0.61}}
beton_6 = {'K225': {'semen': 371, 'pasir': 698, 'kerikil': 1047,'air':215,'w/c':0.58}}
beton_7 = {'K250': {'semen': 384, 'pasir': 692, 'kerikil': 1039,'air':215,'w/c':0.56}}
beton_8 = {'K275': {'semen': 406, 'pasir': 684, 'kerikil': 1026,'air':215,'w/c':0.53}}
beton_9 = {'K300': {'semen': 413, 'pasir': 681, 'kerikil': 1021,'air':215,'w/c':0.52}}
beton_10 = {'K325': {'semen': 439, 'pasir': 670, 'kerikil': 1006,'air':215,'w/c':0.49}}
beton_11 = {'K350': {'semen': 448, 'pasir': 667, 'kerikil': 1000,'air':215,'w/c':0.48}}

#gabung semua dictionary dengan nama beton
beton = {}
for i in range(11):
    beton.update(globals()[f'beton_{i+1}'])

#dari practical example sebelumnya. format dictionary pada tiap beton sudah
#sesuai dengan template yang dapat dibaca oleh pandas.
#yang mana format dataframe contoh beton ini berbeda dengan template pada sub bab dict

#table model 1
df_beton_1 = pd.DataFrame.from_dict(beton)
df_beton_1

#table model 2
df_beton_2 = pd.DataFrame.from_dict(beton, orient='index')
df_beton_2

      semen  pasir  kerikil  air   w/c
K100    247    869      999  215  0.87
K125    276    828     1012  215  0.78
K150    299    799     1017  215  0.72
K175    326    760     1029  215  0.66
K200    352    731     1031  215  0.61
K225    371    698     1047  215  0.58
K250    384    692     1039  215  0.56
K275    406    684     1026  215  0.53
K300    413    681     1021  215  0.52
K325    439    670     1006  215  0.49
K350    448    667     1000  215  0.48

In [2]:
beton

{'K100': {'semen': 247, 'pasir': 869, 'kerikil': 999, 'air': 215, 'w/c': 0.87},
 'K125': {'semen': 276,
  'pasir': 828,
  'kerikil': 1012,
  'air': 215,
  'w/c': 0.78},
 'K150': {'semen': 299,
  'pasir': 799,
  'kerikil': 1017,
  'air': 215,
  'w/c': 0.72},
 'K175': {'semen': 326,
  'pasir': 760,
  'kerikil': 1029,
  'air': 215,
  'w/c': 0.66},
 'K200': {'semen': 352,
  'pasir': 731,
  'kerikil': 1031,
  'air': 215,
  'w/c': 0.61},
 'K225': {'semen': 371,
  'pasir': 698,
  'kerikil': 1047,
  'air': 215,
  'w/c': 0.58},
 'K250': {'semen': 384,
  'pasir': 692,
  'kerikil': 1039,
  'air': 215,
  'w/c': 0.56},
 'K275': {'semen': 406,
  'pasir': 684,
  'kerikil': 1026,
  'air': 215,
  'w/c': 0.53},
 'K300': {'semen': 413,
  'pasir': 681,
  'kerikil': 1021,
  'air': 215,
  'w/c': 0.52},
 'K325': {'semen': 439,
  'pasir': 670,
  'kerikil': 1006,
  'air': 215,
  'w/c': 0.49},
 'K350': {'semen': 448,
  'pasir': 667,
  'kerikil': 1000,
  'air': 215,
  'w/c': 0.48}}